treinadev/orientacao-objetos/catalogo-livros/book-catalogue-home/app/controllers/home_controller.rb

    def index
        @books = Book.all()
---
SELECT "books".* FROM "books"