treinadev/orientacao-objetos/catalogo-livros/book-catalogue-create/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "publication_year", "abstract", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    if @book.save